rorke-time/experiment1-sriov-rorke-time/rorke1750-memtier-250k.txt
Executing: memtier_benchmark -h 128.110.218.200 -p 11211 --ratio=1:10 --test-time=30 --rate-limiting=1250 -t 8 -c 25 --key-pattern=P:P --key-maximum 1000000 -P memcache_text
8         Threads
25        Connections per thread
30        Seconds


ALL STATS
============================================================================================================================
Type         Ops/sec     Hits/sec   Misses/sec    Avg. Latency     p50 Latency     p99 Latency   p99.9 Latency       KB/sec 
----------------------------------------------------------------------------------------------------------------------------
Sets        14310.59          ---          ---         1.07490         0.27900         4.86300         8.95900       962.71 
Gets       143073.87     40598.77    102475.09         1.06600         0.27100         4.60700         8.89500      5891.39 
Waits           0.00          ---          ---             ---             ---             ---             ---          --- 
Totals     157384.45     40598.77    102475.09         1.06681         0.27100         4.63900         8.89500      6854.10 


Request Latency Distribution
Type     <= msec         Percent
------------------------------------------------------------------------
SET       0.039        0.000
SET       0.095        5.000
SET       0.111       10.000
SET       0.135       15.000
SET       0.151       20.000
SET       0.167       25.000
SET       0.183       30.000
SET       0.199       35.000
SET       0.223       40.000
SET       0.247       45.000
SET       0.279       50.000
SET       0.295       52.500
SET       0.311       55.000
SET       0.335       57.500
SET       0.367       60.000
SET       0.399       62.500
SET       0.447       65.000
SET       0.519       67.500
SET       0.703       70.000
SET       1.983       72.500
SET       2.111       75.000
SET       2.175       76.250
SET       2.223       77.500
SET       2.303       78.750
SET       2.383       80.000
SET       2.511       81.250
SET       2.703       82.500
SET       3.343       83.750
SET       3.455       85.000
SET       3.487       86.250
SET       3.519       87.500
SET       3.535       88.125
SET       3.535       88.750
SET       3.551       89.375
SET       3.567       90.000
SET       3.567       90.625
SET       3.583       91.250
SET       3.583       91.875
SET       3.599       92.500
SET       3.599       93.125
SET       3.615       93.750
SET       3.615       94.062
SET       3.631       94.375
SET       3.631       94.688
SET       3.631       95.000
SET       3.647       95.312
SET       3.647       95.625
SET       3.663       95.938
SET       3.679       96.250
SET       3.679       96.562
SET       3.695       96.875
SET       3.711       97.031
SET       3.711       97.188
SET       3.727       97.344
SET       3.743       97.500
SET       3.743       97.656
SET       3.775       97.812
SET       3.791       97.969
SET       3.823       98.125
SET       3.855       98.281
SET       3.919       98.438
SET       3.951       98.516
SET       4.015       98.594
SET       4.095       98.672
SET       4.223       98.750
SET       4.351       98.828
SET       4.543       98.906
SET       4.735       98.984
SET       5.183       99.062
SET       5.375       99.141
SET       5.503       99.219
SET       5.567       99.258
SET       5.631       99.297
SET       5.727       99.336
SET       5.791       99.375
SET       5.983       99.414
SET       6.335       99.453
SET       6.719       99.492
SET       6.975       99.531
SET       7.071       99.570
SET       7.103       99.609
SET       7.135       99.629
SET       7.167       99.648
SET       7.167       99.668
SET       7.199       99.688
SET       7.231       99.707
SET       7.295       99.727
SET       7.359       99.746
SET       7.455       99.766
SET       7.679       99.785
SET       7.999       99.805
SET       8.095       99.814
SET       8.159       99.824
SET       8.255       99.834
SET       8.383       99.844
SET       8.703       99.854
SET       8.767       99.863
SET       8.831       99.873
SET       8.895       99.883
SET       8.959       99.893
SET       8.959       99.902
SET       9.023       99.907
SET       9.023       99.912
SET       9.151       99.917
SET       9.279       99.922
SET       9.407       99.927
SET       9.599       99.932
SET       9.791       99.937
SET      10.303       99.941
SET      10.559       99.946
SET      10.623       99.951
SET      10.623       99.954
SET      10.623       99.956
SET      10.687       99.958
SET      10.687       99.961
SET      10.687       99.963
SET      10.751       99.966
SET      10.751       99.968
SET      10.815       99.971
SET      10.815       99.973
SET      10.879       99.976
SET      10.943       99.977
SET      10.943       99.978
SET      11.007       99.979
SET      11.071       99.980
SET      11.135       99.982
SET      11.263       99.983
SET      11.391       99.984
SET      11.519       99.985
SET      11.647       99.987
SET      11.839       99.988
SET      11.903       99.988
SET      12.095       99.989
SET      12.287       99.990
SET      12.415       99.990
SET      12.415       99.991
SET      12.479       99.991
SET      12.479       99.992
SET      12.543       99.993
SET      12.671       99.993
SET      12.863       99.994
SET      13.247       99.994
SET      13.247       99.995
SET      13.311       99.995
SET      13.375       99.995
SET      13.439       99.995
SET      13.695       99.996
SET      13.759       99.996
SET      13.887       99.996
SET      13.951       99.997
SET      13.951       99.997
SET      14.143       99.997
SET      14.143       99.997
SET      14.143       99.997
SET      14.143       99.998
SET      14.207       99.998
SET      14.207       99.998
SET      14.207       99.998
[...]
SET      14.335       99.998
SET      14.335       99.999
SET      14.335       99.999
SET      14.335       99.999
[...]
SET      15.615       99.999
SET      15.615       99.999
SET      15.615       99.999
[...]
SET      15.871       99.999
SET      15.871       99.999
SET      15.871       99.999
[...]
SET      15.871      100.000
SET      15.999      100.000
SET      15.999      100.000
SET      15.999      100.000
[...]
SET      16.319      100.000
SET      16.319      100.000
---
GET       0.039        0.000
GET       0.087        5.000
GET       0.111       10.000
GET       0.127       15.000
GET       0.143       20.000
GET       0.159       25.000
GET       0.183       30.000
GET       0.199       35.000
GET       0.223       40.000
GET       0.247       45.000
GET       0.271       50.000
GET       0.287       52.500
GET       0.311       55.000
GET       0.335       57.500
GET       0.359       60.000
GET       0.391       62.500
GET       0.439       65.000
GET       0.511       67.500
GET       0.679       70.000
GET       1.959       72.500
GET       2.111       75.000
GET       2.159       76.250
GET       2.223       77.500
GET       2.287       78.750
GET       2.383       80.000
GET       2.511       81.250
GET       2.687       82.500
GET       3.327       83.750
GET       3.455       85.000
GET       3.487       86.250
GET       3.519       87.500
GET       3.535       88.125
GET       3.535       88.750
GET       3.551       89.375
GET       3.551       90.000
GET       3.567       90.625
GET       3.567       91.250
GET       3.583       91.875
GET       3.583       92.500
GET       3.599       93.125
GET       3.615       93.750
GET       3.615       94.062
GET       3.615       94.375
GET       3.631       94.688
GET       3.631       95.000
GET       3.647       95.312
GET       3.647       95.625
GET       3.663       95.938
GET       3.663       96.250
GET       3.679       96.562
GET       3.695       96.875
GET       3.695       97.031
GET       3.711       97.188
GET       3.727       97.344
GET       3.727       97.500
GET       3.743       97.656
GET       3.759       97.812
GET       3.775       97.969
GET       3.807       98.125
GET       3.839       98.281
GET       3.887       98.438
GET       3.919       98.516
GET       3.967       98.594
GET       4.015       98.672
GET       4.095       98.750
GET       4.223       98.828
GET       4.415       98.906
GET       4.575       98.984
GET       4.895       99.062
GET       5.247       99.141
GET       5.407       99.219
GET       5.471       99.258
GET       5.567       99.297
GET       5.631       99.336
GET       5.695       99.375
GET       5.791       99.414
GET       5.951       99.453
GET       6.303       99.492
GET       6.655       99.531
GET       7.007       99.570
GET       7.071       99.609
GET       7.103       99.629
GET       7.135       99.648
GET       7.135       99.668
GET       7.167       99.688
GET       7.199       99.707
GET       7.231       99.727
GET       7.295       99.746
GET       7.359       99.766
GET       7.487       99.785
GET       7.679       99.805
GET       7.807       99.814
GET       7.999       99.824
GET       8.095       99.834
GET       8.127       99.844
GET       8.191       99.854
GET       8.319       99.863
GET       8.703       99.873
GET       8.831       99.883
GET       8.895       99.893
GET       8.895       99.902
GET       8.959       99.907
GET       8.959       99.912
GET       9.023       99.917
GET       9.087       99.922
GET       9.215       99.927
GET       9.343       99.932
GET       9.471       99.937
GET       9.727       99.941
GET       9.983       99.946
GET      10.431       99.951
GET      10.495       99.954
GET      10.559       99.956
GET      10.623       99.958
GET      10.623       99.961
GET      10.623       99.963
GET      10.687       99.966
GET      10.687       99.968
GET      10.751       99.971
GET      10.751       99.973
GET      10.751       99.976
GET      10.751       99.977
GET      10.815       99.978
GET      10.815       99.979
GET      10.879       99.980
GET      10.879       99.982
GET      10.943       99.983
GET      10.943       99.984
GET      11.007       99.985
GET      11.071       99.987
GET      11.199       99.988
GET      11.327       99.988
GET      11.455       99.989
GET      11.519       99.990
GET      11.583       99.990
GET      11.711       99.991
GET      11.839       99.991
GET      12.031       99.992
GET      12.287       99.993
GET      12.351       99.993
GET      12.415       99.994
GET      12.415       99.994
GET      12.479       99.995
GET      12.543       99.995
GET      12.543       99.995
GET      12.607       99.995
GET      12.735       99.996
GET      12.863       99.996
GET      13.247       99.996
GET      13.439       99.997
GET      13.503       99.997
GET      13.503       99.997
GET      13.567       99.997
GET      13.631       99.997
GET      13.695       99.998
GET      13.823       99.998
GET      13.887       99.998
GET      13.951       99.998
GET      14.079       99.998
GET      14.143       99.998
GET      14.207       99.998
GET      14.271       99.999
GET      14.271       99.999
GET      14.271       99.999
[...]
GET      14.335       99.999
GET      14.335       99.999
GET      14.335       99.999
GET      14.399       99.999
GET      14.591       99.999
GET      14.591       99.999
GET      14.655       99.999
GET      14.655       99.999
GET      14.655       99.999
GET      14.719       99.999
GET      15.231       99.999
GET      15.423      100.000
GET      15.615      100.000
GET      15.679      100.000
GET      15.743      100.000
GET      15.807      100.000
GET      15.871      100.000
GET      15.999      100.000
GET      15.999      100.000
GET      16.127      100.000
GET      16.191      100.000
GET      16.255      100.000
GET      16.511      100.000
GET      16.511      100.000
GET      16.511      100.000
GET      17.663      100.000
GET      17.663      100.000
GET      18.175      100.000
GET      18.175      100.000
GET      18.175      100.000
[...]
GET      18.303      100.000
GET      18.303      100.000
GET      18.303      100.000
[...]
GET      18.559      100.000
GET      18.559      100.000
GET      18.559      100.000
[...]
GET      18.687      100.000
GET      18.687      100.000
GET      18.687      100.000
[...]
GET      18.815      100.000
GET      18.815      100.000
---
WAIT      0.000      100.000